manmuqingshan/openblt/Target/Demo/ARMCM4_TM4C_DK_TM4C123G_IAR/Boot/hooks.c
#if (BOOT_FILE_SYS_ENABLE > 0)

/****************************************************************************************
* Constant data declarations
****************************************************************************************/
/** \brief Firmware filename. */
static const blt_char firmwareFilename[] = "/demoprog_dk_tm4c123g.srec";


/************************************************************************************//**
** \brief     Callback that gets called to check whether a firmware update from 
**            local file storage should be started. This could for example be when
**            a switch is pressed, when a certain file is found on the local file 
**            storage, etc.
** \return    BLT_TRUE if a firmware update is requested, BLT_FALSE otherwise.
**
****************************************************************************************/
blt_bool FileIsFirmwareUpdateRequestedHook(void)
{
  FILINFO fileInfoObject = { 0 }; /* needs to be zeroed according to f_stat docs */;

  /* Current example implementation looks for a predetermined firmware file on the 
   * SD-card. If the SD-card is accessible and the firmware file was found the firmware
   * update is started. When successfully completed, the firmware file is deleted.
   * During the firmware update, progress information is written to a file called
   * bootlog.txt and additionally outputted on UART @57600 bps for debugging purposes.
   */
  /* check if firmware file is present and SD-card is accessible */
  if (f_stat(firmwareFilename, &fileInfoObject) == FR_OK) 
  {
    /* check if the filesize is valid and that it is not a directory */
    if ( (fileInfoObject.fsize > 0) && (!(fileInfoObject.fattrib & AM_DIR)) )
    {
      /* all conditions are met to start a firmware update from local file storage */
      return BLT_TRUE;
    }
  }
  /* still here so no firmware update request is pending */  
  return BLT_FALSE;
} /*** end of FileIsFirmwareUpdateRequestedHook ***/


/************************************************************************************//**
** \brief     Callback to obtain the filename of the firmware file that should be
**            used during the firmware update from the local file storage. This 
**            hook function is called at the beginning of the firmware update from
**            local storage sequence. 
** \return    valid firmware filename with full path or BLT_NULL.
**
****************************************************************************************/
const blt_char *FileGetFirmwareFilenameHook(void)
{
  return firmwareFilename;
} /*** end of FileGetFirmwareFilenameHook ***/
#endif /* BOOT_FILE_SYS_ENABLE > 0 */


/****************************************************************************************
*   E V E N T S   M O D U L E   H O O K   F U N C T I O N S
****************************************************************************************/

#if (BOOT_EVENTS_ENABLE > 0)
/****************************************************************************************
* Local data declarations.
****************************************************************************************/
#if (BOOT_FILE_SYS_ENABLE > 0)
/** \brief Data structure for grouping log-file related information. */
static struct
{
  FIL      handle;                  /**< FatFS handle to the log-file.                 */
  blt_bool canUse;                  /**< Flag to indicate if the log-file can be used. */
} logFile;
#endif


/***********************************************************************************//**
** \brief     Callback that gets called when a firmware update related event gets
**            triggered. Implement your event handling here. For example for updating
**            a user interface or for logging purposes.
**            Cast the opaque info pointer to the correct structure type (tEventsInfoXxx)
**            to access additional event related information.
** \param     id The identifier of the event that occurred.
** \param     info Opaque pointer to event identifier related information. Can be 
**            BLT_NULL depending on the event identifer. For example when no additional
**            information available for the event.
** \return    none
**
****************************************************************************************/
void EventsHook(tEventsId id, void const *info)
{
#if (BOOT_FILE_SYS_ENABLE > 0)
  blt_addr         base_addr;
  blt_int32u       num_bytes;
  blt_int8u        progress;
  blt_char const * filename;
  tEventsErrorId   error_id;
  static blt_bool  update_from_file = BLT_FALSE;
  static blt_char  logStr[128];                /* Made static to lower the stack load. */

  /* Filter on the events identifier. */
  switch (id)
  {
    case EVENT_ID_ON_START:
      update_from_file = BLT_FALSE;
      logFile.canUse = BLT_FALSE;
      filename = ((tEventsInfoStart const *)info)->filename;
      /* Only log the firmware update events when performing a firmware update from the
       * FAT file system.
       */
      if (filename != BLT_NULL)
      {
        /* Set flag to indicate this is a firmware update from a local file system. */
        update_from_file = BLT_TRUE;
        /* Create or overwrite the logfile. */
        if (f_open(&logFile.handle, "/bootlog.txt", FA_CREATE_ALWAYS | FA_WRITE) == FR_OK)
        {
          logFile.canUse = BLT_TRUE;
        }
      }
      /* Write event related information to the log file. */
      if (logFile.canUse == BLT_TRUE)
      {
        sprintf(logStr, "Firmware update started (%s)\n", filename);
        if (f_puts(logStr, &logFile.handle) < 0)
        {
          logFile.canUse = BLT_FALSE;
          f_close(&logFile.handle);
        }
      }
      break;

    case EVENT_ID_ON_ERASE:
      /* Write event related information to the log file. */
      base_addr = ((tEventsInfoErase const *)info)->base_addr;
      num_bytes = ((tEventsInfoErase const *)info)->num_bytes;
      if (logFile.canUse == BLT_TRUE)
      {
        sprintf(logStr, "Erasing %lu bytes from %08Xh\n",
                (unsigned long)num_bytes, (unsigned int)base_addr);
        if (f_puts(logStr, &logFile.handle) < 0)
        {
          logFile.canUse = BLT_FALSE;
          f_close(&logFile.handle);
        }
      }
      break;

    case EVENT_ID_ON_WRITE:
      /* Write event related information to the log file. */
      base_addr = ((tEventsInfoWrite const *)info)->base_addr;
      num_bytes = ((tEventsInfoWrite const *)info)->num_bytes;
      progress  = ((tEventsInfoWrite const *)info)->progress;
      if (logFile.canUse == BLT_TRUE)
      {
        sprintf(logStr, "Programming %3u bytes at %08Xh [%3u%%]\n",
                (unsigned int)num_bytes, (unsigned int)base_addr,
                (unsigned int)progress);
        if (f_puts(logStr, &logFile.handle) < 0)
        {
          logFile.canUse = BLT_FALSE;
          f_close(&logFile.handle);
        }
      }
      break;

